// 62. 不同路径

// 一个机器人位于一个 m x n 网格的左上角 （起始点在下图中标记为 “Start” ）。

// 机器人每次只能向下或者向右移动一步。机器人试图达到网格的右下角（在下图中标记为 “Finish” ）。

// 问总共有多少条不同的路径？

// 示例 1：
// 输入：m = 3, n = 7
// 输出：28

// 示例 2：
// 输入：m = 3, n = 2
// 输出：3

// 解释：
// 从左上角开始，总共有 3 条路径可以到达右下角。
// 1. 向右 -> 向下 -> 向下
// 2. 向下 -> 向下 -> 向右
// 3. 向下 -> 向右 -> 向下

// 示例 3：
// 输入：m = 7, n = 3
// 输出：28

// 示例 4：
// 输入：m = 3, n = 3
// 输出：6

// 提示：
// 1 <= m, n <= 100
// 题目数据保证答案小于等于 2 * 109

/**
 * @param {number} m
 * @param {number} n
 * @return {number}
 */
var uniquePaths = function (m, n) {
  if (m === 1 && n === 1) return 1;
  // dp[i][j] 表示到坐标（i，j）可能的路径数量
  // dp[1][0] = 1
  // dp[0][1] = 1
  // dp[1][1] = 2
  // 到达（i，j）的前提是，可以到达 (i-1，j) 和 (i, j-1)，并且保证(i+1<m, j+1<n)
  // dp[i][j] = dp[i-1][j] + dp[i][j-1]
  let dp = new Array(m).fill(0).map(() => new Array(n).fill(0));
  dp[0]?.[1] === 0 && (dp[0][1] = 1);
  dp[1]?.[0] === 0 && (dp[1][0] = 1);

  for (let i = 0; i < m; i++) {
    for (let j = 0; j < n; j++) {
      dp[i][j] = dp[i - 1 < 0 ? 0 : i - 1][j] + dp[i][j - 1 < 0 ? 0 : j - 1];
    }
  }

  return dp[m - 1][n - 1];
};

console.log(uniquePaths(3, 3));
